; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v5)
		(pred_4 ?v1)
		(pred_6 ?v6)
		(pred_3 ?v6)
		(pred_1 ?v1 ?v6)
		(pred_5)
		(pred_2 ?v1))

   (:action op_1
       :parameters  (?v2 ?v4)
       :precondition (and (not-eq ?v2 ?v4) 
                          (pred_6 ?v2) (pred_6 ?v4) (pred_3 ?v2))
       :effect (and  (pred_3 ?v4)
		     (not (pred_3 ?v2))))


   (:action op_3
       :parameters (?v3 ?v7)
       :precondition  (and  (pred_4 ?v3) (pred_6 ?v7)
			    (pred_1 ?v3 ?v7) (pred_3 ?v7) (pred_5))
       :effect (and (pred_2 ?v3)
		    (not (pred_1 ?v3 ?v7)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v3  ?v7)
       :precondition  (and  (pred_4 ?v3) (pred_6 ?v7)
			    (pred_2 ?v3) (pred_3 ?v7))
       :effect (and (pred_1 ?v3 ?v7)
		    (pred_5)
		    (not (pred_2 ?v3)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_02 obj_08 obj_04 obj_07 obj_01 obj_03 
          obj_06 obj_05 
)
(:init
(pred_6 obj_02)
(pred_6 obj_08)
(pred_6 obj_04)
(pred_6 obj_07)
(pred_6 obj_01)
(pred_6 obj_03)
(pred_4 obj_06)
(pred_4 obj_05)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(pred_5)
(pred_1 obj_06 obj_03)
(pred_1 obj_05 obj_02)
(pred_3 obj_07)
)
(:goal
(and
(pred_1 obj_06 obj_03)
(pred_1 obj_05 obj_04)
)
)

(:constraints
  (sometime-before  (pred_1 obj_05 obj_04) (pred_3 obj_08))
)
)

; plan
1. (op_1 obj_07 obj_02)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_02)
   goals met: 1 of 2
2. (op_3 obj_05 obj_02)
   deleted: (pred_1 obj_05 obj_02) (pred_5)
   added: (pred_2 obj_05)
   goals met: 1 of 2
3. (op_1 obj_02 obj_03)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_03)
   goals met: 1 of 2
4. (op_2 obj_05 obj_03)
   deleted: (pred_2 obj_05)
   added: (pred_1 obj_05 obj_03) (pred_5)
   goals met: 1 of 2
5. (op_3 obj_06 obj_03)
   deleted: (pred_1 obj_06 obj_03) (pred_5)
   added: (pred_2 obj_06)
   goals met: 0 of 2
6. (op_1 obj_03 obj_08)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_08)
   goals met: 0 of 2
7. (op_2 obj_06 obj_08)
   deleted: (pred_2 obj_06)
   added: (pred_1 obj_06 obj_08) (pred_5)
   goals met: 0 of 2
8. (op_1 obj_08 obj_03)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_03)
   goals met: 0 of 2
9. (op_3 obj_05 obj_03)
   deleted: (pred_1 obj_05 obj_03) (pred_5)
   added: (pred_2 obj_05)
   goals met: 0 of 2
10. (op_1 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 0 of 2
11. (op_2 obj_05 obj_04)
   deleted: (pred_2 obj_05)
   added: (pred_1 obj_05 obj_04) (pred_5)
   goals met: 1 of 2
12. (op_1 obj_04 obj_08)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_08)
   goals met: 1 of 2
13. (op_3 obj_06 obj_08)
   deleted: (pred_1 obj_06 obj_08) (pred_5)
   added: (pred_2 obj_06)
   goals met: 1 of 2
14. (op_1 obj_08 obj_03)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_03)
   goals met: 1 of 2
15. (op_2 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_1 obj_06 obj_03) (pred_5)
   goals met: 2 of 2
